
# 3
# ------------------------------------------------------------------------
# 2022-10-25
#
#
#

# 2
# ------------------------------------------------------------------------
# 2022-10-22
#
# gu.widget._viewport   view 设置裁剪会改变全局，而窗口尺寸改变时，该参数并未调整
#
#       2022-10-23      在窗口尺寸改变时通知 view ，进行一次全局裁剪是否开启的测试
#
# gu.widget._taproot    root_update root_render 需要深度测试和裁剪测试设置和重置
#
#       2022-10-23      在 root_update root_render 前后通知 view
#

# 1
# ------------------------------------------------------------------------
# 2022-10-15
#
# gu.widget             需要增加 font, Label, Button, Palette 等内容
#
#       2022-10-17      添加 gu.widget._typist 只能在 widget 内部写字
#                       todo 外部写字会有深度测试问题，需要再做一个外部字体显示
#                       todo 缺少替换字体的功能
#
# gu.widget._taproot    todo 需要增加 root 的其它行为，比如点击、拖动、键盘输入
#
